app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 16 Sep 2015 19:48:28 UTC +00:00], ["name", "Private Jets"], ["updated_at", Wed, 16 Sep 2015 19:48:28 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    if @category.save