app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = User.first  #TODO: fix after authentication
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1