app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(body: params[:comment][:body])
    @comment.creator = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "This site is a great nested resource!"], ["created_at", Sun, 20 Sep 2015 02:16:48 UTC +00:00], ["post_id", 1], ["updated_at", Sun, 20 Sep 2015 02:16:48 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    vote = Vote.create(voteable: comment, creator: current_user, vote: params[:vote] )
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 Oct 2015 02:47:54 UTC +00:00], ["updated_at", Sat, 03 Oct 2015 02:47:54 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 2], ["voteable_type", "Comment"]]