app/controllers/posts_controller.rb

  def vote
   Vote.create(voteable: @post, creator: current_user,  vote: params[:vote] )
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 02 Oct 2015 20:40:51 UTC +00:00], ["updated_at", Fri, 02 Oct 2015 20:40:51 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 2], ["voteable_type", "Post"]]