app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT 1
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 16 Sep 2015 17:23:02 UTC +00:00], ["description", "This is the description"], ["title", "Some Title"], ["updated_at", Wed, 16 Sep 2015 17:23:02 UTC +00:00], ["url", "Some URL"]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = User.first #TODO: Change once we have authentication

    if @post.save